sdaiPutAttr(Sdai_instS*,Sdai_instS*,SdaiPrimitiveType,BTEllipsis)
\details
Set a new value of the application instance attribute.
\param instance  [in] An instance that contains the attribute.
\param attribute [in] An attribute to set the value.
\param valueType [in] A value data type.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAT_NDEF - Attribute not defined.
* sdaiVT_NVLD - Value type invalid.
* sdaiAT_NVLD - Attribute invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance readWriteAppInstance138 = ...;
SdaiAttr attrElevationReadWriteEntityInstance138 = getAttrDefinition(readWriteAppInstance138, "elevation");
sdaiPutAttr(readWriteAppInstance138, attrElevationReadWriteEntityInstance138, sdaiREAL, 100.0);
...